# Operando `Dataframes` com `Merge`, `Join` e `Concat`

In [1]:
%config Completer.use_jedi = False
%config IPCompleter.greedy=True

In [2]:
import pandas as pd

In [3]:
week1 = pd.read_csv("../Dados/Restaurant - Week 1 Sales.csv")
week1_stats = pd.read_csv("../Dados/Restaurant - Week 1 Satisfaction.csv")
week2 = pd.read_csv("../Dados/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("../Dados/Restaurant - Customers.csv")
foods = pd.read_csv("../Dados/Restaurant - Foods.csv")

## O m√©todo `pd.concat()` para concatenar dataframes

In [4]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [5]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [6]:
week = pd.concat([week1, week2], ignore_index=True)
week = week1.append(other=week2, ignore_index=True)
week = week2.append(other=week1, ignore_index=True)

In [7]:
sales = pd.concat(objs=[week1, week2], keys=["Week 1", "Week 2"])
sales.head(3)

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1

In [8]:
sales.loc[("Week 1",)]
sales.loc[("Week 2",120)]
sales.loc[("Week 2",120), "Food ID"]
sales.loc[("Week 2",120), ["Customer ID", "Food ID"]]

Customer ID    508
Food ID          4
Name: (Week 2, 120), dtype: int64

## `Inner Joins` com diferentes `Dataframes`

In [9]:
sales.head(5)

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1
       3          202        2
       4          155        9

In [10]:
customers.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [11]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [12]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [13]:
week1.merge(week2, how='inner', on="Customer ID", suffixes=(' - Week1', ' - Week2'))

    Customer ID  Food ID - Week1  Food ID - Week2
0           537                9                5
1           155                9                3
2           155                1                3
3           503                5                8
4           503                5                9
..          ...              ...              ...
57          945                5                4
58          343                3                5
59          343                3                2
60          343                3                7
61          621                9                6

[62 rows x 3 columns]

In [14]:
week1.merge(week2, how='inner', on=["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [15]:
week1[week1["Customer ID"] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [16]:
week2[week2["Customer ID"] == 21]

    Customer ID  Food ID
30           21        4

## `Outer Joins` com diferentes `Dataframes`

In [17]:
merged = week1.merge(week2, how="outer", on="Customer ID", suffixes=(' - Week1', ' - Week2'), indicator="Origin")

In [18]:
merged["Origin"].value_counts()

right_only    197
left_only     195
both           62
Name: Origin, dtype: int64

In [19]:
exclusive_merged = merged[merged["Origin"].isin(["right_only", "left_only"])]

In [20]:
exclusive_merged["Origin"].value_counts()

right_only    197
left_only     195
both            0
Name: Origin, dtype: int64

## `Left Joins` com diferentes `Dataframes`

In [21]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [22]:
foods.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [23]:
week1.merge(foods, how='left', on='Food ID')
week1.merge(foods, how='left', on='Food ID', sort=True)

     Customer ID  Food ID Food Item  Price
0            658        1     Sushi   3.99
1            600        1     Sushi   3.99
2            155        1     Sushi   3.99
3            341        1     Sushi   3.99
4             20        1     Sushi   3.99
..           ...      ...       ...    ...
245          809       10     Drink   1.75
246          584       10     Drink   1.75
247          274       10     Drink   1.75
248          151       10     Drink   1.75
249          535       10     Drink   1.75

[250 rows x 4 columns]

## Os Par√¢metros `left_on` e `rigth_on`

In [24]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [25]:
customers.head(2)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [26]:
week2.merge(customers, how='left', left_on='Customer ID', right_on='ID')
week2.merge(customers, how='left', left_on='Customer ID', right_on='ID').drop("ID", axis='columns')
week2.merge(customers, how='left', left_on='Customer ID', right_on='ID', sort=True).drop("ID", axis='columns')

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,8,6,Frances,Adams,Female,Dabshots,Developer III
1,13,2,Ruth,Alvarez,Female,Twitterlist,Mechanical Systems Engineer
2,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive
3,24,8,Donna,Thomas,Female,Jaxbean,Chief Design Engineer
4,27,4,Jessica,Bennett,Female,Twitternation,Account Executive
...,...,...,...,...,...,...,...
245,968,4,Teresa,Reynolds,Female,Flashdog,Budget/Accounting Analyst IV
246,969,3,Marie,Ortiz,Female,Meejo,Research Associate
247,977,7,Cynthia,Dixon,Female,Skalith,Automation Specialist II
248,994,2,Clarence,Morgan,Male,Edgewire,Geologist II
249,996,10,Debra,Garcia,Female,Dazzlesphere,Structural Engineer

## Merge a partir de √≠ndices com os par√¢metros `left_index` e `right_index`

In [27]:
week1 = pd.read_csv("../Dados/Restaurant - Week 1 Sales.csv")
week1_stats = pd.read_csv("../Dados/Restaurant - Week 1 Satisfaction.csv")
week2 = pd.read_csv("../Dados/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("../Dados/Restaurant - Customers.csv", index_col="ID")
foods = pd.read_csv("../Dados/Restaurant - Foods.csv", index_col="Food ID")

In [28]:
sales=week1.merge(customers, how='left', left_on="Customer ID", right_index=True)
sales = sales.merge(foods, how='left', left_on="Food ID", right_index=True)
sales.head(8)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III,Burrito,9.99
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III,Donut,0.99
5,213,8,Keith,Foster,Male,Gigashots,VP Quality Control,Salad,11.25
6,600,1,Sandra,Bailey,Female,Jaxnation,Sales Associate,Sushi,3.99
7,503,5,Justin,Daniels,Male,Oloo,Environmental Tech,Pizza,2.49

In [29]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [30]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [31]:
week1.merge(week2, how='left', left_index=True, right_index=True, suffixes=[" - Week 1", " - Week 2"])

,Customer ID - Week 1,Food ID - Week 1,Customer ID - Week 2,Food ID - Week 2
0,537,9,688,10
1,97,4,813,7
2,658,1,495,10
3,202,2,189,5
4,155,9,267,3
...,...,...,...,...
245,413,9,783,10
246,926,6,556,10
247,134,3,547,9
248,396,6,252,9
249,535,10,249,6

## O m√©todo `.join()` para concatenar verticalmente dois `Dataframes`

In [32]:
week1 = pd.read_csv("../Dados/Restaurant - Week 1 Sales.csv")
week1_stats = pd.read_csv("../Dados/Restaurant - Week 1 Satisfaction.csv")
week2 = pd.read_csv("../Dados/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("../Dados/Restaurant - Customers.csv")
foods = pd.read_csv("../Dados/Restaurant - Foods.csv")
w1_rate = pd.read_csv("../Dados/Restaurant - Week 1 Satisfaction.csv")

In [33]:
w1_rate.head(3)

   Satisfaction Rating
0                    2
1                    7
2                    3

In [34]:
week1.merge(w1_rate, how='left', left_index=True, right_index=True).head()

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3
3          202        2                    7
4          155        9                   10

In [35]:
week1.join(w1_rate).head()

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3
3          202        2                    7
4          155        9                   10